## Pandas

* Pandas is used to analyse data & big data, and make conclusion based on stastistical theories

* Pandas is typically used to clean messy data & make them readable & simple to access.

* It can also help in finding the relationship between coloumns (co-relation)

* It can also be used in doing all statistical methodologies as well as plotting & creating graphs

* It can handle multiple type pf data structures (Excel,CSV,Json,RDBMS,html,pdf etc.. )

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (1.4.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (1.23.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 22.3.1 is available.
You should consider upgrading via the 'C:\Users\admin\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.4.3'

## Series

* A series is a **1-Dimensional Array like object** containing a sequence of values (of similar data types) and an associated array of data labels called as **indexes**

In [4]:
ser1 = pd.Series([10,20,30,40,50])

In [5]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
import numpy as np
arr = np.array([100,200,300,400])

In [7]:
arr

array([100, 200, 300, 400])

## defining the indexes

In [8]:
ser2 = pd.Series([100,200,300,400,500],index=['d','b','a','c','e'])

In [9]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [10]:
ser2['a']

300

In [11]:
ser2[2]

300

In [12]:
ser3 = pd.Series([100,200,300],index=['1','2','3'])

In [13]:
ser3

1    100
2    200
3    300
dtype: int64

In [14]:
ser3[2]

300

In [15]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [16]:
ser2.index

Index(['d', 'b', 'a', 'c', 'e'], dtype='object')

In [17]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [18]:
ser1.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [20]:
ser1[1:3]

1    20
2    30
dtype: int64

In [21]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [22]:
ser2['d':'a']

d    100
b    200
a    300
dtype: int64

In [23]:
ser3

1    100
2    200
3    300
dtype: int64

In [24]:
ser3[0:2]

1    100
2    200
dtype: int64

In [25]:
ser3[0:2]

1    100
2    200
dtype: int64

In [26]:
ser3['1':'3']

1    100
2    200
3    300
dtype: int64

In [27]:
ser3

1    100
2    200
3    300
dtype: int64

In [28]:
ser3.index

Index(['1', '2', '3'], dtype='object')

In [29]:
ser3['1':'2']

1    100
2    200
dtype: int64

In [30]:
ser3[0:3]

1    100
2    200
3    300
dtype: int64

In [31]:
ser3[0:2]

1    100
2    200
dtype: int64

In [32]:
ser3[1:2]

2    200
dtype: int64

In [33]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [34]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [35]:
ser1[0]

10

In [36]:
ser1[[0,3,4]]

0    10
3    40
4    50
dtype: int64

In [37]:
ser2

d    100
b    200
a    300
c    400
e    500
dtype: int64

In [38]:
ser2[['b','c','e']]

b    200
c    400
e    500
dtype: int64

In [39]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [40]:
ser1 > 20

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [41]:
ser1[ser1>20]

2    30
3    40
4    50
dtype: int64

In [42]:
type(ser1)

pandas.core.series.Series

In [43]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [44]:
ser1+50

0     60
1     70
2     80
3     90
4    100
dtype: int64

In [45]:
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [46]:
ser1 * 50

0     500
1    1000
2    1500
3    2000
4    2500
dtype: int64

In [47]:
ser1/50

0    0.2
1    0.4
2    0.6
3    0.8
4    1.0
dtype: float64

In [48]:
ser1//50

0    0
1    0
2    0
3    0
4    1
dtype: int64

In [49]:
ser1 ** 2

0     100
1     400
2     900
3    1600
4    2500
dtype: int64

In [50]:
ser1[1:3]*30

1    600
2    900
dtype: int64

In [51]:
data = {
    'Mumbai':1700,
    'Delhi':3000,
    'Nagpur':5000,
    'Chennai':['hello','hi','bye']
}

In [52]:
data

{'Mumbai': 1700,
 'Delhi': 3000,
 'Nagpur': 5000,
 'Chennai': ['hello', 'hi', 'bye']}

In [53]:
ser5 = pd.Series(data)

In [54]:
ser5

Mumbai                 1700
Delhi                  3000
Nagpur                 5000
Chennai    [hello, hi, bye]
dtype: object

In [55]:
ser5.index

Index(['Mumbai', 'Delhi', 'Nagpur', 'Chennai'], dtype='object')

In [56]:
ser5['Mumbai']

1700

In [57]:
ser5[0]

1700

In [58]:
data

{'Mumbai': 1700,
 'Delhi': 3000,
 'Nagpur': 5000,
 'Chennai': ['hello', 'hi', 'bye']}

In [59]:
ser8 = pd.Series(data)

In [60]:
ser8

Mumbai                 1700
Delhi                  3000
Nagpur                 5000
Chennai    [hello, hi, bye]
dtype: object

In [61]:
ser8['Chennai'][0:2]

['hello', 'hi']

In [62]:
data = {
    'Mumbai':1700,
    'Delhi':3000,
    'Nagpur':5000,
    'Chennai':3212
}

In [63]:
data

{'Mumbai': 1700, 'Delhi': 3000, 'Nagpur': 5000, 'Chennai': 3212}

In [64]:
city = ['Mumbai','Delhi','Nagpur','Chennai','Ahemdabad']

In [65]:
ser1 = pd.Series(data,index=city)

In [66]:
ser1

Mumbai       1700.0
Delhi        3000.0
Nagpur       5000.0
Chennai      3212.0
Ahemdabad       NaN
dtype: float64

In [67]:
pd.notnull(ser1)

Mumbai        True
Delhi         True
Nagpur        True
Chennai       True
Ahemdabad    False
dtype: bool

In [68]:
pd.isnull(ser1)

Mumbai       False
Delhi        False
Nagpur       False
Chennai      False
Ahemdabad     True
dtype: bool

In [69]:
ser1

Mumbai       1700.0
Delhi        3000.0
Nagpur       5000.0
Chennai      3212.0
Ahemdabad       NaN
dtype: float64

In [70]:
ser1[pd.notnull(ser1)]

Mumbai     1700.0
Delhi      3000.0
Nagpur     5000.0
Chennai    3212.0
dtype: float64

In [71]:
s1 = pd.Series(10,index=['test'])

In [72]:
s1

test    10
dtype: int64

In [73]:
s2 = pd.Series(20,index=['Test'])

In [74]:
s2

Test    20
dtype: int64

In [75]:
s1+s2

Test   NaN
test   NaN
dtype: float64

**Data Frame**


* A dataframe represents a rectangular table of data & consists ordered collections of columns which can be of different data-types

* The DataFrame has both rows & columns index, it can be thought as a dictionary of series, all sharing same indexes

* The data is stored in **one or more 2-D block**

<img src="https://media.geeksforgeeks.org/wp-content/uploads/finallpandas.png" width="550" height="450">

In [131]:
data1 = {
    'State' : ['Mumbai','Pune','Chennai','Delhi','Nagpur'],
    'year' : [2001,2011,2018,2019,2020],
    'population':[1.5,1.7,3.6,6.2,3.2]
}

In [77]:
data1

{'State': ['Mumbai', 'Pune', 'Chennai', 'Delhi', 'Nagpur'],
 'year': [2001, 2011, 2018, 2019, 2020],
 'population': [1.5, 1.7, 3.6, 6.2, 3.2]}

In [132]:
pd.Series(data1)

State         [Mumbai, Pune, Chennai, Delhi, Nagpur]
year                  [2001, 2011, 2018, 2019, 2020]
population                 [1.5, 1.7, 3.6, 6.2, 3.2]
dtype: object

In [134]:
df = pd.DataFrame(data1)

In [135]:
df

     State  year  population
0   Mumbai  2001         1.5
1     Pune  2011         1.7
2  Chennai  2018         3.6
3    Delhi  2019         6.2
4   Nagpur  2020         3.2

In [81]:
df.head(3)  #if you are not providing any argument then the default value is 5

     State  year  population
0   Mumbai  2001         1.5
1     Pune  2011         1.7
2  Chennai  2018         3.6

In [82]:
df.tail(2) #it will show you the data from below, and the default value is 5

    State  year  population
3   Delhi  2019         6.2
4  Nagpur  2020         3.2

In [83]:
df

     State  year  population
0   Mumbai  2001         1.5
1     Pune  2011         1.7
2  Chennai  2018         3.6
3    Delhi  2019         6.2
4   Nagpur  2020         3.2

In [140]:
df2 = pd.DataFrame(data1,index=['one','two','three','four','five'],columns=['State','year','population','debt'])

In [85]:
df2

         State  year  population debt
one     Mumbai  2001         1.5  NaN
two       Pune  2011         1.7  NaN
three  Chennai  2018         3.6  NaN
four     Delhi  2019         6.2  NaN
five    Nagpur  2020         3.2  NaN

In [86]:
df2.columns

Index(['State', 'year', 'population', 'debt'], dtype='object')

In [87]:
df2.columns = ['STATE','YEAR','POPULATION','DEBT']

In [89]:
df2

         STATE  YEAR  POPULATION DEBT
one     Mumbai  2001         1.5  NaN
two       Pune  2011         1.7  NaN
three  Chennai  2018         3.6  NaN
four     Delhi  2019         6.2  NaN
five    Nagpur  2020         3.2  NaN

In [90]:
df2['STATE']

one       Mumbai
two         Pune
three    Chennai
four       Delhi
five      Nagpur
Name: STATE, dtype: object

In [92]:
df2[['STATE','POPULATION']]  #fetching multiple columns

         STATE  POPULATION
one     Mumbai         1.5
two       Pune         1.7
three  Chennai         3.6
four     Delhi         6.2
five    Nagpur         3.2

In [93]:
df2['DEBT']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
Name: DEBT, dtype: object

In [94]:
df2['DEBT'] = 0

In [95]:
df2

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     0
two       Pune  2011         1.7     0
three  Chennai  2018         3.6     0
four     Delhi  2019         6.2     0
five    Nagpur  2020         3.2     0

In [96]:
df2['DEBT'] = np.arange(1,6)

In [97]:
df2

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     1
two       Pune  2011         1.7     2
three  Chennai  2018         3.6     3
four     Delhi  2019         6.2     4
five    Nagpur  2020         3.2     5

In [98]:
df2.loc['three']

STATE         Chennai
YEAR             2018
POPULATION        3.6
DEBT                3
Name: three, dtype: object

In [100]:
df2.iloc[2]

STATE         Chennai
YEAR             2018
POPULATION        3.6
DEBT                3
Name: three, dtype: object

In [101]:

df2.loc[['one','four']]  ## fetching multiple rows.

       STATE  YEAR  POPULATION  DEBT
one   Mumbai  2001         1.5     1
four   Delhi  2019         6.2     4

In [102]:
df2.iloc[[0,2,4]]

         STATE  YEAR  POPULATION  DEBT
one     Mumbai  2001         1.5     1
three  Chennai  2018         3.6     3
five    Nagpur  2020         3.2     5

In [103]:
df2.iloc[2]

STATE         Chennai
YEAR             2018
POPULATION        3.6
DEBT                3
Name: three, dtype: object

In [112]:
df2

         State  year  population debt
one     Mumbai  2001         1.5  NaN
two       Pune  2011         1.7  NaN
three  Chennai  2018         3.6  NaN
four     Delhi  2019         6.2  NaN
five    Nagpur  2020         3.2  NaN

In [113]:
df2

         State  year  population debt
one     Mumbai  2001         1.5  NaN
two       Pune  2011         1.7  NaN
three  Chennai  2018         3.6  NaN
four     Delhi  2019         6.2  NaN
five    Nagpur  2020         3.2  NaN

In [136]:
df2

        State  year  population  debt
one    Mumbai  2001         1.5   NaN
two      Pune  2022         1.7   NaN
three    2022  2022      2022.0  2022
four    Delhi  2019         6.2   NaN
five   Nagpur  2020         3.2   NaN

In [137]:
df2['year']['two'] = 2022

C:\Users\admin\AppData\Local\Temp\ipykernel_7460\857979125.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['year']['two'] = 2022

In [141]:
df2

         State  year  population debt
one     Mumbai  2001         1.5  NaN
two       Pune  2011         1.7  NaN
three  Chennai  2018         3.6  NaN
four     Delhi  2019         6.2  NaN
five    Nagpur  2020         3.2  NaN

In [139]:
# df2['year']['five']

one      2001
two      2022
three    2022
four     2019
five     2020
Name: year, dtype: int64

## index objects

In [142]:
obj = pd.Series(range(3),index=['a','b','c'])

In [144]:
obj
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [145]:
my_index = obj.index

In [146]:
my_index

Index(['a', 'b', 'c'], dtype='object')

In [147]:
my_index[0]

'a'

In [148]:
my_index[0] = 'x'

TypeError: Index does not support mutable operations

In [149]:
obj2 = pd.Series([4.1,7.5,-8.3,3.6],index=['d','a','b','c'])

In [150]:
obj2

d    4.1
a    7.5
b   -8.3
c    3.6
dtype: float64

In [151]:
res = obj2.reindex(['a','b','c','d'])

In [152]:
res

a    7.5
b   -8.3
c    3.6
d    4.1
dtype: float64

In [156]:
obj2

d    4.1
a    7.5
b   -8.3
c    3.6
dtype: float64

In [155]:
obj2.reindex(['a','b','c','d'])

a    7.5
b   -8.3
c    3.6
d    4.1
dtype: float64

In [157]:
obj3 = pd.Series(['blue','purple','red'],index=[0,2,4])

In [158]:
obj3

0      blue
2    purple
4       red
dtype: object

In [161]:
res1 = obj3.reindex(range(7),method='ffill')

In [162]:
res1

0      blue
1      blue
2    purple
3    purple
4       red
5       red
6       red
dtype: object

In [163]:
obj3

0      blue
2    purple
4       red
dtype: object

In [164]:
obj3.reindex(range(6),method='bfill')

0      blue
1    purple
2    purple
3       red
4       red
5       NaN
dtype: object

## dropping entries in series

In [165]:
obj4 = pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [166]:
obj4

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [167]:
obj4.drop('c')

a    0
b    1
d    3
e    4
dtype: int32

In [168]:
obj4

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [169]:
obj4.drop(['a','d','e'])

b    1
c    2
dtype: int32

In [170]:
df3 = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=['Mumbai','Pune','Chennai','Delhi'],
                  columns=['one','two','three','four'])

In [171]:
df3

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [173]:
df3.drop(['Pune','Delhi'])

         one  two  three  four
Mumbai     0    1      2     3
Chennai    8    9     10    11

In [174]:
df3

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [176]:
df3.drop('three',axis=1)

         one  two  four
Mumbai     0    1     3
Pune       4    5     7
Chennai    8    9    11
Delhi     12   13    15

In [177]:
df3

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [178]:
df3.drop(['one','four'],axis=1)

         two  three
Mumbai     1      2
Pune       5      6
Chennai    9     10
Delhi     13     14